--1.입사일 중 입사 날짜가 17일인 직원의 이름, 입사일 출력
--2.2003년에 입사한 직원의 이름, 입사일을 출력. 관계연산자를 사용. %like을 사용 
--3.직원 중에서 부서 아이디가 없는 직원의 이름을 조회하시오.
--4. 사원 아이디가 105번이 아닌 사원번호, 사원 이름 
--5. 다음 문장을 단어별로 첫글자만 대문자로 바꾸시오. Nct iN the HOUse
--6. 36.754를 반올림하여 소수 첫째자리까지 구하시오.
--7. 2017년 11월 18일에 입사한 사람은 오늘까지 몇 개월 근무했는가?
--8. 오늘 날짜로부터 최초로 만나는 목요일은?

--9. 각 부서별 최대 급여와 최소 급여 및 평균 급여, 급여 합계, 인원수를 출력하시오.
-- 단 최대 급여와 최소급여가 같다고 나오는 부서는 출력에서 제외.

--10. 월 별 입사자 수를 조회하고, 입사자 수가 가장 적은 상위 8개의 월만 출력하며 정렬하여 출력
-- 출력은 입사월, 입사자 수를 출력하되 지금 글자를 alias로 사용. 

--11. 사원의 이름, 급여, 부서명을 출력하시오. 단, 사원없이 부서이름만 있는 부서명도 출력하게 하시오.

--12. 직원의 사번아이디, 매니저 아이디, 매니저 이름을 출력하시오. 단 관리자가 없는 직원도 출력.

--13. Daniel이 근무하는 부서의 평균 급여를 구하여 출력하시오. 

--14. 각 부서별로 최저급여를 받는 직원의 이름과 부서 아이디, 급여를 조회하시오. 단 출력은 부서아이디를 오름차순.
--15. 직원 중에서 직책명이 Manager로 마무리 되는 직원에 대해 10% 급여를 인상하고, 
--Clerk으로 마무리되는 직원은 20%, 나머지 직원은 30% 인상하려고 한다.
--직원의 이름, 직책, 급여 ,인상된 급여를 출력하시오.

--16. 각 부서별 최대급여를 받는 직원의 이름, 부서명, 급여를 조회출력하시오.

--17. 사원의 이름, 부서 id, 급여를 조회출력하시오. 단, 사원이 속한 해당 부서의 최소급여를 부서ID 다음에 넣어 출력하시오.
--서브 쿼리가 select 절에 있으면 scala 서브쿼리이며 1행만 반환.  from inline view, where 절에 있으면 subquery이다.

--18. 사원의 급여가 자신이 속한 부서의 평균 급여보다 많은 사원에 대해 사원명, 급여, 평균급여를 조회출력하시오. 
-- 단 from 절에 subquery를 사용하시오.

--19. 커미션을 가장 많이 받는 상위 3명의 이름과 커미션을 조회출력 하시오.

--20. 전체직원의 급여를 많은 순부터 정렬한 후 1,2,...107 번호를 출력하시오. 단 출력은 이름, 급여, 등수를 출력하고, 급여가 같으면 같은 등수를 매김

--21. 직책에 대한 평균급여 중 가장 큰 평균 급여에 대한 직책과 해당 평균 급여를 조회출력하시오.

--22. 이름, 전화번호, 부서아이디로 형성된 비상연락망 테이블을 만드시오.

--23. Alexander 라는 이름의 사원을 Daniel이 근무하는 부서롤 부서를 수정(부서이동) 하시오.

--시험문제1.
--커미션을 받는 사원 중에서 5000이상 10000 사이의 급여를 받는 사원의 이름, 부서아이디, 급여를 출력하시오.
--단, 부서가 없는 사원은 부서없음으로 출력하며 급여 내림차순으로 출력하시오.

--문제2
--사원을 입사년도 별로 묶어 해당 입사년도별 사원수를 조회 출력하시오. 단, 사원수 내림차순으로 출력하시오.

--문제3.
--직책에 'Ma'가 들어있는 사원 중 급여가 1000이상인 사원의 이름, 급여, 직책을 출력하시오.
--단, 급여 오름차순으로 출력하시오.

--문제4
--사원의 이름 및 근무하는 부서명, 그리고 근무하는 국가명을 출력하시오.
--단 부서명이 없는 사원도 나오게 하시오.

















